Repository: pegazus-alpha/TradeWithBillion
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr

# update.log_confirming_deposit
source: [DEBUG] Confirming deposit: user_id={user_id}, amount={amount}
fr: [DEBUG] Confirmation du dépôt : user_id={user_id}, amount={amount}

# update.log_admin_notification_success
source: [SUCCESS] Admin notification sent for user {user_id}
fr: [SUCCÈS] Notification admin envoyée pour l'utilisateur {user_id}

# update.log_admin_notification_failed
source: [ERROR] Failed to send admin notification: {error}
fr: [ERREUR] Échec de l'envoi de la notification admin : {error}

# update.log_user_notified
source: [SUCCESS] User {user_id} notified of confirmed deposit
fr: [SUCCÈS] Utilisateur {user_id} notifié du dépôt confirmé

# update.log_user_notification_failed
source: [ERROR] Failed to notify user {user_id}: {error}
fr: [ERREUR] Échec de la notification de l'utilisateur {user_id} : {error}

# update.log_deposit_cancelled
source: [INFO] Additional deposit cancelled by admin
fr: [INFO] Dépôt supplémentaire annulé par l'admin

# update.log_invalid_confirmation
source: [ERROR] Invalid confirmation data: {error}
fr: [ERREUR] Données de confirmation invalides : {error}

# update.log_testing_balance
source: [DEBUG] Testing balance update for user {user_id} with amount {amount}
fr: [DEBUG] Test de mise à jour du solde pour l'utilisateur {user_id} avec le montant {amount}

# update.log_user_does_not_exist
source: [ERROR] User {user_id} does not exist
fr: [ERREUR] L'utilisateur {user_id} n'existe pas

# update.log_test_success
source: [SUCCESS] Balance update test completed
fr: [SUCCÈS] Test de mise à jour du solde terminé

# update.log_test_failed
source: [ERROR] Balance update test failed
fr: [ERREUR] Échec du test de mise à jour du solde

# update.error_get_registration_date
source: [Error] get_user_registration_date: {error}
fr: [Erreur] get_user_registration_date : {error}

# update.error_update_balance
source: [Error] update_balance: {error}
fr: [Erreur] mettre_a_jour_solde : {error}

# update.pattern_confirm_supp
source: confirm_supp_
fr: confir_supp_

# update.pattern_cancel_supp
source: cancel_supp
fr: annuler_supp

# update.hash_transaction_depot_supplementaire
source: hash_transaction_additional_deposit
fr: hash_transaction_depot_supplementaire

# user.user_udi_number
source: 🆔 Your UDI number: {udi}
fr: 🆔 Votre numéro UDI : {udi}

# user.user_binance_address
source: 💼 Binance deposit address: {address}
fr: 💼 Adresse de dépôt Binance : {address}

# user.user_balance
source: 💰 Balance: {balance}
fr: 💰 Solde : {balance}

# user.user_registration_date
source: 📅 Registration date: {date}
fr: 📅 Date d'inscription : {date}

# user.user_not_registered
source: ℹ️ You are not registered yet. Please make an investment to get started.
fr: ℹ️ Vous n'êtes pas encore inscrit. Veuillez faire un investissement pour commencer.

# user.user_address_not_registered
source: Not registered
fr: Non enregistré

# user.user_info_error
source: Error
fr: Erreur

# user.log_error_register_user
source: [Error] register_user: {error}
fr: [Erreur] enregistrer_utilisateur : {error}

# user.log_error_get_user_info
source: [Error] get_user_info: {error}
fr: [Erreur] get_infos_utilisateur : {error}

# user.log_error_user_exists
source: [Error] user_exists: {error}
fr: [Erreur] utilisateur_existe : {error}

# user.default_language
source: en
fr: fr
