Repository: pegazus-alpha/TradeWithBillion
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr

# admin.access_denied
source: Access denied. You are not authorized to use this command.
fr: Accès refusé. Vous n'êtes pas autorisé à utiliser cette commande.

# admin.no_users_found
source: No users found in the database.
fr: Aucun utilisateur trouvé dans la base de données.

# admin.users_list_header
source: List of registered users:
fr: Liste des utilisateurs enregistrés :

# admin.user_id_label
source: User ID
fr: ID Utilisateur

# admin.language_label
source: Language
fr: Langue

# admin.amount_deposited_label
source: Amount Deposited
fr: Montant Déposé

# admin.registration_date_label
source: Registration Date
fr: Date d'Inscription

# admin.total_profit_label
source: Total Profit
fr: Profit Total

# admin.last_update_label
source: Last Update
fr: Dernière Mise à Jour

# admin.error_retrieving_users
source: Error retrieving users: {error}
fr: Erreur lors de la récupération des utilisateurs : {error}

# admin.provide_user_id
source: Please provide a user ID.\nUsage: /user_info <user_id>
fr: Veuillez fournir un ID utilisateur.\nUtilisation : /info_utilisateur <user_id>

# admin.user_not_found
source: User not found.
fr: Utilisateur non trouvé.

# admin.user_info_header
source: Information for user ID {user_id}:
fr: Informations pour l'utilisateur ID {user_id} :

# admin.wallet_address_label
source: Wallet Address
fr: Adresse du Portefeuille

# admin.error_occurred
source: An error occurred: {error}
fr: Une erreur s'est produite : {error}

# admin.set_description_usage
source: Usage: /set_description <wallet_id> <new_description>
fr: Utilisation : /set_description <wallet_id> <nouvelle_description>

# admin.description_updated
source: Description updated successfully.
fr: Description mise à jour avec succès.

# depot.investment_exists
source: ❌ You already have an active investment, use /top_up instead
fr: ❌ Vous avez déjà un investissement en cours, utilisez /top_up à la place

# depot.enter_deposit_amount
source: Please enter the USDT amount you wish to deposit:
fr: Veuillez saisir le montant USDT que vous souhaitez déposer :

# depot.invalid_positive_amount
source: ❌ Please enter a valid positive amount. Try again:
fr: ❌ Veuillez saisir un montant positif valide. Réessayez :

# depot.invalid_numeric_amount
source: ❌ Please enter a valid numeric amount. Try again:
fr: ❌ Veuillez saisir un montant numérique valide. Réessayez :

# depot.deposit_amount_confirm
source: You want to deposit {amount} USDT.\n\nPlease send the amount to the following wallet address:\n\nUse the Binance Smart Chain (BEP20) blockchain network.
fr: Vous souhaitez déposer {amount} USDT.\n\nVeuillez envoyer le montant à l'adresse de portefeuille suivante :\n\nUtilisez le réseau blockchain Binance Smart Chain (BEP20).

# depot.enter_transaction_hash
source: Now, please enter your transaction hash to confirm the deposit:
fr: Maintenant, veuillez saisir le hash de votre transaction pour confirmer le dépôt :

# depot.btn_confirm
source: ✅ Confirm
fr: ✅ Confirmer

# depot.btn_cancel
source: ❌ Cancel
fr: ❌ Annuler

# depot.admin_deposit_notification
source: New deposit request:\nUser: {username}\nUser ID: {user_id}\nAmount: {amount} USDT\nTransaction Hash:
fr: Nouvelle demande de dépôt :\nUtilisateur : {username}\nID Utilisateur : {user_id}\nMontant : {amount} USDT\nHash de Transaction :

# depot.deposit_request_processing
source: ✅ Your deposit request and transaction hash is being processed. You will be notified shortly.
fr: ✅ Votre demande de dépôt et hash de transaction est en cours de traitement. Vous serez notifié sous peu.

# globale.support_message
source: If you need assistance, please contact our team at @TWBLiveChat
fr: Si vous avez besoin d'assistance, veuillez contacter notre équipe à @TWBLiveChat

# globale.useful_links_header
source: 🔗 Useful links:
fr: 🔗 Liens utiles :

# globale.about_us_header
source: About us:
fr: À propos de nous :

# globale.about_title
source: Automated Futures Trading and Earn 25% per Week with TWB
fr: Trading Automatisé de Futures et Gagnez 25% par Semaine avec TWB

# globale.about_description
source: This advanced system trades for you, generating 25% weekly returns on your capital for 2 months or more—scalable according to your investment.
fr: Ce système avancé trade pour vous, générant 25% de rendement hebdomadaire sur votre capital pendant 2 mois ou plus—évolutif selon votre investissement.

# globale.best_part_title
source: The Best Part? No Lock-up!
fr: Le Plus ? Pas de Blocage !

# globale.best_part_description
source: Your funds remain flexible—withdraw your capital anytime without restrictions.
fr: Vos fonds restent flexibles—retirez votre capital à tout moment sans restrictions.

# globale.how_it_works_title
source: How it Works:
fr: Comment ça Marche :

# globale.step_1
source: ⿡ Deposit – Fund your account securely.
fr: ⿡ Déposer – Financez votre compte en toute sécurité.

# globale.step_2
source: ⿢ Wait 7 Days – Let TWB work its magic.
fr: ⿢ Attendre 7 Jours – Laissez TWB faire sa magie.

# globale.step_3
source: ⿣ Withdraw Profits – Enjoy consistent, hassle-free gains
fr: ⿣ Retirer les Profits – Profitez de gains constants et sans tracas

# retraits.enter_wallet_address
source: Please enter your wallet address for withdrawal:
fr: Veuillez saisir votre adresse de portefeuille pour le retrait :

# retraits.invalid_input
source: ❌ Invalid input. Please try again.
fr: ❌ Saisie invalide. Veuillez réessayer.

# retraits.select_blockchain_network
source: Please select the blockchain network:
fr: Veuillez sélectionner le réseau blockchain :

# retraits.invalid_wallet_format
source: ❌ The wallet address format does not match the selected blockchain network.
fr: ❌ Le format de l'adresse de portefeuille ne correspond pas au réseau blockchain sélectionné.

# retraits.withdrawal_request_received
source: ✅ Your withdrawal request has been received. Please wait a moment.
fr: ✅ Votre demande de retrait a été reçue. Veuillez patienter un moment.

# retraits.withdrawal_request_recorded
source: ✅ Your withdrawal request has been recorded.
fr: ✅ Votre demande de retrait a été enregistrée.

# retraits.admin_withdrawal_header
source: 📤 [WITHDRAWAL]
fr: 📤 [RETRAIT]

# retraits.admin_username
source: 👤 Username: @{username}
fr: 👤 Nom d'utilisateur : @{username}

# retraits.admin_telegram_id
source: 🆔 Telegram ID: {user_id}
fr: 🆔 ID Telegram : {user_id}

# retraits.admin_binance_deposit
source: 💸 Binance Deposit Address: {binance_depot}
fr: 💸 Adresse de Dépôt Binance : {binance_depot}

# retraits.admin_balance
source: 💰 Balance: {balance}
fr: 💰 Solde : {balance}

# retraits.admin_available_amount
source: 💸 Available Amount: {available_amount}
fr: 💸 Montant Disponible : {available_amount}

# retraits.admin_wallet_address
source: 🔍 Wallet Address: {address}
fr: 🔍 Adresse de Portefeuille : {address}

# retraits.admin_blockchain_network
source: 🌐 Blockchain Network: {network}
fr: 🌐 Réseau Blockchain : {network}

# retraits.btn_done
source: ✅ Done
fr: ✅ Terminé

# retraits.btn_not
source: ❌ No
fr: ❌ Non

# retraits.invalid_hash
source: ❌ Invalid hash. Please try again.
fr: ❌ Hash invalide. Veuillez réessayer.

# retraits.invalid_hash_format
source: ❌ Invalid hash format. Hash must start with '0x' and contain 64 hexadecimal characters.
fr: ❌ Format de hash invalide. Le hash doit commencer par '0x' et contenir 64 caractères hexadécimaux.

# retraits.user_not_found
source: ⚠️ Error: user not found.
fr: ⚠️ Erreur : utilisateur non trouvé.

# retraits.withdrawal_processed
source: ✅ Your withdrawal has been processed successfully.\n\n🔗 Transaction hash:
fr: ✅ Votre retrait a été traité avec succès.\n\n🔗 Hash de transaction :

# retraits.user_notified
source: ✅ User has been notified with the transaction hash.
fr: ✅ L'utilisateur a été notifié avec le hash de transaction.

# retraits.failed_notify_user
source: ⚠️ Failed to notify user: {error}
fr: ⚠️ Échec de la notification à l'utilisateur : {error}

# retraits.enter_transaction_hash
source: ✅ Please enter the transaction hash to confirm the withdrawal:
fr: ✅ Veuillez saisir le hash de transaction pour confirmer le retrait :

# retraits.withdrawal_not_confirmed
source: ❌ Withdrawal was not confirmed.
fr: ❌ Le retrait n'a pas été confirmé.

# store.product_1_name
source: Product 1
fr: Produit 1

# store.product_1_description
source: Product 1 description
fr: Description du produit 1

# store.product_2_name
source: Product 2
fr: Produit 2

# store.product_2_description
source: Product 2 description
fr: Description du produit 2

# store.product_3_name
source: Product 3
fr: Produit 3

# store.product_3_description
source: Product 3 description
fr: Description du produit 3

# store.product_4_name
source: Product 4
fr: Produit 4

# store.product_4_description
source: Product 4 description
fr: Description du produit 4

# store.product_5_name
source: Product 5
fr: Produit 5

# store.product_5_description
source: Product 5 description
fr: Description du produit 5

# store.product_6_name
source: Product 6
fr: Produit 6

# store.product_6_description
source: Product 6 description
fr: Description du produit 6

# store.product_7_name
source: Product 7
fr: Produit 7

# store.product_7_description
source: Product 7 description
fr: Description du produit 7

# store.product_8_name
source: Product 8
fr: Produit 8

# store.product_8_description
source: Product 8 description
fr: Description du produit 8

# store.store_header
source: 🏪 **OUR STORE**
fr: 🏪 **NOTRE BOUTIQUE**

# store.store_intro
source: Discover our selection of quality products!\nHere is our gallery of available products:
fr: Découvrez notre sélection de produits de qualité !\nVoici notre galerie de produits disponibles :

# store.gallery_caption
source: 🛍️ Here are our available products:
fr: 🛍️ Voici nos produits disponibles :

# store.store_footer_message
source: For any questions or orders, please contact our support team!\n\n🔔 Stay tuned to discover our new products!
fr: Pour toute question ou commande, veuillez contacter notre équipe de support !\n\n🔔 Restez à l'écoute pour découvrir nos nouveaux produits !

# store.product_price_label
source: 💰 Price: {price}
fr: 💰 Prix : {price}

# store.btn_more_info
source: 💬 More info
fr: 💬 Plus d'infos

# store.btn_order
source: 🛒 Order
fr: 🛒 Commander

# store.btn_order_now
source: 🛒 Order now
fr: 🛒 Commander maintenant

# store.btn_back_to_store
source: ⬅️ Back to store
fr: ⬅️ Retour à la boutique

# store.btn_contact_support
source: 📞 Contact support
fr: 📞 Contacter le support

# store.detailed_description_header
source: 📝 **Detailed description:**
fr: 📝 **Description détaillée :**

# store.price_header
source: 💰 **Price:** {price}
fr: 💰 **Prix :** {price}

# store.features_header
source: ✅ **Features:**
fr: ✅ **Caractéristiques :**

# store.feature_premium_quality
source: • Premium quality
fr: • Qualité premium

# store.feature_fast_delivery
source: • Fast delivery
fr: • Livraison rapide

# store.feature_warranty
source: • Warranty included
fr: • Garantie incluse

# store.contact_more_info
source: 📞 Contact us for more information!
fr: 📞 Contactez-nous pour plus d'informations !

# store.order_header
source: 🛒 **ORDER: {product_name}**
fr: 🛒 **COMMANDE : {product_name}**

# store.order_instructions_header
source: 📞 **To finalize your order:**
fr: 📞 **Pour finaliser votre commande :**

# store.order_step_1
source: 1. Contact our support
fr: 1. Contactez notre support

# store.order_step_2
source: 2. Specify the product
fr: 2. Spécifiez le produit

# store.order_step_3
source: 3. Confirm your delivery address
fr: 3. Confirmez votre adresse de livraison

# store.order_confirmation
source: ✅ Our team will contact you shortly!
fr: ✅ Notre équipe vous contactera sous peu !

# store.back_to_store_message
source: 🏪 Back to store...\n\nUse the /our_store command to see our products again.
fr: 🏪 Retour à la boutique...\n\nUtilisez la commande /our_store pour voir à nouveau nos produits.

# store.contact_support_header
source: 📞 **CONTACT SUPPORT**
fr: 📞 **CONTACTER LE SUPPORT**

# store.support_intro
source: Our team is here to help you!
fr: Notre équipe est là pour vous aider !

# store.support_email
source: 📧 Email: support@yourcompany.com
fr: 📧 Email : support@votreentreprise.com

# store.support_telegram
source: 💬 Telegram: @your_support
fr: 💬 Telegram : @votre_support

# store.support_hours
source: ⏰ Hours: 9am–6pm (Mon–Fri)
fr: ⏰ Horaires : 9h–18h (Lun–Ven)

# store.support_response
source: We will respond to you as soon as possible!
fr: Nous vous répondrons dans les plus brefs délais !

# telegrame.welcome_message
source: Welcome! To get started, use the commands to proceed.
fr: Bienvenue ! Pour commencer, utilisez les commandes pour procéder.

# telegrame.operation_cancelled
source: ❌ Operation cancelled.
fr: ❌ Opération annulée.

# telegrame.previous_operation_cancelled
source: ❌ Previous operation cancelled. Starting new command: {command}
fr: ❌ Opération précédente annulée. Démarrage de la nouvelle commande : {command}

# telegrame.action_cancelled
source: ❌ Action cancelled.
fr: ❌ Action annulée.

# telegrame.benefits_update_title
source: 🎉 **Benefits Update!**
fr: 🎉 **Mise à Jour des Bénéfices !**

# telegrame.new_benefits
source: 💰 **New benefits:** {amount:.2f} USDT ({weeks} week(s))
fr: 💰 **Nouveaux bénéfices :** {amount:.2f} USDT ({weeks} semaine(s))

# telegrame.total_benefits
source: 📈 **Total benefits:** {amount:.2f} USDT
fr: 📈 **Total des bénéfices :** {amount:.2f} USDT

# telegrame.initial_investment
source: 💳 **Initial investment:** {amount:.2f} USDT
fr: 💳 **Investissement initial :** {amount:.2f} USDT

# telegrame.wallet_address
source: 🏦 **Wallet address:** {address}
fr: 🏦 **Adresse de portefeuille :** {address}

# telegrame.wallet_not_provided
source: Not provided
fr: Non fournie

# telegrame.benefits_added_message
source: Your benefits have been automatically added to your account!
fr: Vos bénéfices ont été automatiquement ajoutés à votre compte !

# telegrame.join_channel_message
source: Join our channel to stay informed: https://t.me/+c0mWuQVC6OEwMTM0
fr: Rejoignez notre canal pour rester informé : https://t.me/+c0mWuQVC6OEwMTM0

# telegrame.admin_benefits_update
source: 📊 **Automatic benefits update**
fr: 📊 **Mise à jour automatique des bénéfices**

# telegrame.admin_user_id
source: 👤 **User ID:** {user_id}
fr: 👤 **ID Utilisateur :** {user_id}

# telegrame.admin_benefits_added
source: 💰 **Benefits added:** {amount:.2f} USDT
fr: 💰 **Bénéfices ajoutés :** {amount:.2f} USDT

# telegrame.admin_new_total_benefits
source: 📈 **New total benefits:** {amount:.2f} USDT
fr: 📈 **Nouveaux bénéfices totaux :** {amount:.2f} USDT

# telegrame.admin_investment
source: 💳 **Investment:** {amount:.2f} USDT
fr: 💳 **Investissement :** {amount:.2f} USDT

# telegrame.admin_update_date
source: 🕒 **Update date:** {date}
fr: 🕒 **Date de mise à jour :** {date}

# telegrame.admin_weeks_processed
source: ⏱️ **Weeks processed:** {weeks}
fr: ⏱️ **Semaines traitées :** {weeks}

# telegrame.existing_investment_error
source: ❌ You already have an active investment, use /top_up instead
fr: ❌ Vous avez déjà un investissement en cours, utilisez /top_up à la place

# telegrame.deposit_confirmed_admin
source: ✅ Deposit of {amount} USDT confirmed for user ID {user_id}.
fr: ✅ Dépôt de {amount} USDT confirmé pour l'utilisateur ID {user_id}.

# telegrame.deposit_confirmed_user
source: ✅ Your deposit of {amount} USDT has been confirmed successfully. Thank you!\nJoin our channel to stay informed of all the latest information:\nhttps://t.me/+c0mWuQVC6OEwMTM0
fr: ✅ Votre dépôt de {amount} USDT a été confirmé avec succès. Merci !\nRejoignez notre canal pour rester informé de toutes les dernières informations :\nhttps://t.me/+c0mWuQVC6OEwMTM0

# telegrame.menu_deposit
source: 💰 Deposit
fr: 💰 Dépôt

# telegrame.menu_withdraw
source: 💸 Withdraw
fr: 💸 Retrait

# telegrame.menu_top_up
source: 📈 Top Up
fr: 📈 Recharge

# telegrame.menu_our_store
source: 🏪 Our Store
fr: 🏪 Notre Boutique

# telegrame.menu_my_info
source: 👤 My Info
fr: 👤 Mes Infos

# telegrame.menu_market_update
source: 📊 Market Update
fr: 📊 Actualité Marché

# telegrame.menu_about
source: ℹ️ About
fr: ℹ️ À Propos

# telegrame.admin_user_list
source: 👥 User List
fr: 👥 Liste Utilisateurs

# telegrame.admin_user_info
source: 🔍 User Info
fr: 🔍 Info Utilisateur

# telegrame.cancel_button
source: ❌ Cancel
fr: ❌ Annuler

# telegrame.log_starting_benefits_system
source: 🚀 Starting automatic benefits verification system...
fr: 🚀 Démarrage du système de vérification automatique des bénéfices...

# telegrame.log_checking_frequency
source: ⏰ Checking every 30 minutes, updating benefits every 7 days
fr: ⏰ Vérification toutes les 30 minutes, mise à jour des bénéfices toutes les 7 jours

# telegrame.log_benefits_updated
source: ✅ Benefits updated for {count} user(s) at {time}
fr: ✅ Bénéfices mis à jour pour {count} utilisateur(s) à {time}

# telegrame.error_user_notification
source: [User notification error]: {error}
fr: [Erreur de notification utilisateur] : {error}

# telegrame.error_admin_notification
source: [Admin notification error for user {user_id}]: {error}
fr: [Erreur de notification admin pour l'utilisateur {user_id}] : {error}

# telegrame.error_user_processing
source: [User processing error {user_id}]: {error}
fr: [Erreur de traitement utilisateur {user_id}] : {error}

# telegrame.error_benefits_verification
source: [Benefits verification error]: {error}
fr: [Erreur de vérification des bénéfices] : {error}

# telegrame.error_verification_loop
source: [Verification loop error]: {error}
fr: [Erreur dans la boucle de vérification] : {error}

# telegrame.error_callback_admin
source: [Error] callback_query_handler_admin: {error}
fr: [Erreur] callback_query_handler_admin : {error}

# telegrame.pattern_confirm
source: confirm_
fr: confirmer_

# telegrame.pattern_cancel
source: cancel
fr: annuler

# telegrame.pattern_withdrawal_done
source: withdrawal_done_
fr: retrait_done_

# telegrame.pattern_withdrawal_not
source: withdrawal_not_
fr: retrait_not_

# telegrame.pattern_product_info
source: product_info_
fr: info_produit_

# telegrame.pattern_order_product
source: order_product_
fr: commander_produit_

# telegrame.pattern_store_return
source: store_return
fr: retour_boutique

# update.must_register_first
source: ❌ You must first register using /deposit before making a deposit.
fr: ❌ Vous devez d'abord vous inscrire en utilisant /deposit avant de faire un dépôt.

# update.balance_update_not_profitable
source: It would not be profitable for you to do this now. Please wait for the cycle to end in {days} days.
fr: Il ne serait pas rentable pour vous de faire cela maintenant. Veuillez attendre la fin du cycle dans {days} jours.

# update.balance_update_wait
source: Balance update is not possible today. Please wait {days} more days for the next update window.
fr: La mise à jour du solde n'est pas possible aujourd'hui. Veuillez attendre {days} jours de plus pour la prochaine fenêtre de mise à jour.

# update.balance_update_allowed
source: Balance update is allowed.
fr: La mise à jour du solde est autorisée.

# update.registration_date_not_found
source: Registration date not found.
fr: Date d'inscription non trouvée.

# update.additional_deposit_amount
source: 💰 How much would you like to deposit additionally? (in USDT):
fr: 💰 Combien souhaitez-vous déposer en plus ? (en USDT) :

# update.invalid_amount_error
source: ❌ Please enter a valid and positive amount (numbers only).
fr: ❌ Veuillez saisir un montant valide et positif (chiffres uniquement).

# update.amount_error_restart
source: ❌ Error: Amount not found. Please restart the process.
fr: ❌ Erreur : Montant non trouvé. Veuillez redémarrer le processus.

# update.additional_deposit_info
source: Thank you. To make an additional deposit of {amount:.2f} USDT, here is the information:\n📥 Platform wallet address in the next message:\n🌐 Blockchain network: Binance Smart Chain (BSC)\n\nOnce the transfer is made, the admin will confirm your deposit.
fr: Merci. Pour effectuer un dépôt supplémentaire de {amount:.2f} USDT, voici les informations :\n📥 Adresse de portefeuille de la plateforme dans le message suivant :\n🌐 Réseau blockchain : Binance Smart Chain (BSC)\n\nUne fois le transfert effectué, l'admin confirmera votre dépôt.

# update.hash_request_message
source: Please now enter your transaction hash to confirm the additional deposit:
fr: Veuillez maintenant saisir le hash de votre transaction pour confirmer le dépôt supplémentaire :

# update.processing_request
source: ✅ Your additional deposit request and transaction hash is being processed. You will be notified shortly.
fr: ✅ Votre demande de dépôt supplémentaire et hash de transaction est en cours de traitement. Vous serez notifié sous peu.

# update.processing_error
source: ❌ Error processing the request. Please try again.
fr: ❌ Erreur lors du traitement de la demande. Veuillez réessayer.

# update.admin_additional_deposit_title
source: 📥 [ADDITIONAL DEPOSIT INITIATED]
fr: 📥 [DÉPÔT SUPPLÉMENTAIRE INITIÉ]

# update.admin_user_info
source: 👤 User: @{username}
fr: 👤 Utilisateur : @{username}

# update.admin_telegram_id
source: 🆔 Telegram ID: {user_id}
fr: 🆔 ID Telegram : {user_id}

# update.admin_declared_amount
source: 💵 Additional amount declared: {amount:.2f} USDT
fr: 💵 Montant supplémentaire déclaré : {amount:.2f} USDT

# update.admin_transaction_hash
source: 🔗 Transaction Hash:
fr: 🔗 Hash de Transaction :

# update.admin_user_registered
source: ℹ️ User already registered
fr: ℹ️ Utilisateur déjà enregistré

# update.confirm_deposit_button
source: ✅ Confirm deposit
fr: ✅ Confirmer le dépôt

# update.cancel_button_supp
source: ❌ Cancel
fr: ❌ Annuler

# update.additional_deposit_confirmed
source: ✅ Additional deposit of {amount:.2f} USDT confirmed for user {user_id}.
fr: ✅ Dépôt supplémentaire de {amount:.2f} USDT confirmé pour l'utilisateur {user_id}.

# update.additional_deposit_confirmed_user
source: ✅ Your additional deposit of {amount:.2f} USDT has been confirmed successfully and added to your balance.
fr: ✅ Votre dépôt supplémentaire de {amount:.2f} USDT a été confirmé avec succès et ajouté à votre solde.

# update.balance_update_failed
source: ❌ Failed to update balance for user {user_id}. Please check the database.
fr: ❌ Échec de la mise à jour du solde pour l'utilisateur {user_id}. Veuillez vérifier la base de données.

# update.additional_deposit_cancelled
source: ❌ Additional deposit cancelled
fr: ❌ Dépôt supplémentaire annulé

# update.invalid_confirmation_data
source: ❌ Invalid confirmation data.
fr: ❌ Données de confirmation invalides.

# update.log_database_path
source: [DEBUG] Using database at: {path}
fr: [DEBUG] Utilisation de la base de données à : {path}

# update.log_updating_user
source: [DEBUG] Updating user_id: {user_id} with added_amount: {amount}
fr: [DEBUG] Mise à jour user_id : {user_id} avec montant_ajoute : {amount}

# update.log_sql_update
source: [DEBUG] SQL: UPDATE users SET deposit_amount = {total} WHERE user_id = {user_id}
fr: [DEBUG] SQL : UPDATE utilisateurs SET montant_depot = {total} WHERE user_id = {user_id}

# update.log_balance_success
source: [SUCCESS] Balance updated for user {user_id}: {current} + {added} = {total}
fr: [SUCCÈS] Solde mis à jour pour l'utilisateur {user_id} : {current} + {added} = {total}

# update.log_user_not_found
source: [ERROR] User {user_id} not found in database
fr: [ERREUR] Utilisateur {user_id} non trouvé dans la base de données

# update.log_callback_data
source: [DEBUG] Callback data received: {data}
fr: [DEBUG] Données de callback reçues : {data}

# update.log_parsed_parts
source: [DEBUG] Parsed parts: {parts}
fr: [DEBUG] Parties analysées : {parts}
